In [1]:
import pandas as pd

In [2]:
a = [1,2,3]
a

[1, 2, 3]

In [3]:
df = pd.DataFrame(a , columns=['number'])
df

   number
0       1
1       2
2       3

In [4]:
df.columns

Index(['number'], dtype='object')

In [5]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [6]:
df['person'] = ['sam','tony','powell']
df

   number  person
0       1     sam
1       2    tony
2       3  powell

In [7]:
pd.DataFrame({'number':[1,2,3] , 'person':['sam','tony','powell'] })

   number  person
0       1     sam
1       2    tony
2       3  powell

In [8]:
df.number

0    1
1    2
2    3
Name: number, dtype: int64

In [9]:
df['number']

0    1
1    2
2    3
Name: number, dtype: int64

In [10]:
df.person

0       sam
1      tony
2    powell
Name: person, dtype: object

In [11]:
df = pd.DataFrame({'stock':['Apple','Tesla','Nvidia'] , 'price':[200,150,600] , 'quantity':[20,10,25] })
df

    stock  price  quantity
0   Apple    200        20
1   Tesla    150        10
2  Nvidia    600        25

In [12]:
df.price * df.quantity

0     4000
1     1500
2    15000
dtype: int64

In [13]:
df['value'] = df.price * df.quantity
df

    stock  price  quantity  value
0   Apple    200        20   4000
1   Tesla    150        10   1500
2  Nvidia    600        25  15000

In [14]:
df[['stock','value']]

    stock  value
0   Apple   4000
1   Tesla   1500
2  Nvidia  15000

In [15]:
df

    stock  price  quantity  value
0   Apple    200        20   4000
1   Tesla    150        10   1500
2  Nvidia    600        25  15000

In [16]:
df.iloc[0,0]

'Apple'

In [17]:
df.iloc[:,0]

0     Apple
1     Tesla
2    Nvidia
Name: stock, dtype: object

In [18]:
df.iloc[1:,0]

1     Tesla
2    Nvidia
Name: stock, dtype: object

In [19]:
df.iloc[:,:]

    stock  price  quantity  value
0   Apple    200        20   4000
1   Tesla    150        10   1500
2  Nvidia    600        25  15000

In [20]:
df.iloc[:,[1,3]]

   price  value
0    200   4000
1    150   1500
2    600  15000

In [21]:
df

    stock  price  quantity  value
0   Apple    200        20   4000
1   Tesla    150        10   1500
2  Nvidia    600        25  15000

In [22]:
df.loc[1]

stock       Tesla
price         150
quantity       10
value        1500
Name: 1, dtype: object

In [23]:
df.loc[0,'stock']

'Apple'

In [24]:
df.loc[0:,'stock']

0     Apple
1     Tesla
2    Nvidia
Name: stock, dtype: object

In [25]:
df.loc[0:,'stock':]

    stock  price  quantity  value
0   Apple    200        20   4000
1   Tesla    150        10   1500
2  Nvidia    600        25  15000

In [26]:
df.loc[1:2,'stock':'quantity']

    stock  price  quantity
1   Tesla    150        10
2  Nvidia    600        25

In [27]:
df.price>200

0    False
1    False
2     True
Name: price, dtype: bool

In [28]:
df[df.price>200]

    stock  price  quantity  value
2  Nvidia    600        25  15000

In [29]:
df.stock == 'Tesla'

0    False
1     True
2    False
Name: stock, dtype: bool

In [30]:
df[df.stock == 'Tesla']

   stock  price  quantity  value
1  Tesla    150        10   1500

In [31]:
(df.quantity>22) & (df.price >180)

0    False
1    False
2     True
dtype: bool

In [32]:
df[(df.quantity>22) & (df.price >180)]

    stock  price  quantity  value
2  Nvidia    600        25  15000

In [33]:
df[(df.quantity>22) | (df.price >180)]

    stock  price  quantity  value
0   Apple    200        20   4000
2  Nvidia    600        25  15000